In [1]:
import pandas as pd
df = pd.read_csv("saleries.csv")
df.head()

  company                  job    degree  sallery_more_than_100k
0  google      sales executive  bachelor                       0
1  google      sales executive   masters                       0
2  google      sales executive  bachelor                       1
3  google      sales executive   masters                       1
4  google  computer programmer  bachelor                       0

In [2]:
inputs = df.drop('sallery_more_than_100k', axis='columns')
target = df['sallery_more_than_100k']

In [3]:
inputs

       company                  job    degree
0       google      sales executive  bachelor
1       google      sales executive   masters
2       google      sales executive  bachelor
3       google      sales executive   masters
4       google  computer programmer  bachelor
5       google  computer programmer   masters
6   abc pharma      sales executive   masters
7   abc pharma  computer programmer  bachelor
8   abc pharma    bussiness manager  bachelor
9   abc pharma    bussiness manager   masters
10    facebook      sales executive  bachelor
11    facebook      sales executive   masters
12    facebook    bussiness manager  bachelor
13    facebook    bussiness manager   masters
14    facebook  computer programmer  bachelor
15    facebook  computer programmer   masters

In [4]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: sallery_more_than_100k, dtype: int64

In [5]:
from sklearn.preprocessing import LabelEncoder

In [6]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [7]:
#encode comapny, job, degree in numbers
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_company.fit_transform(inputs['job'])
inputs['degree_n'] = le_company.fit_transform(inputs['degree'])
inputs.head()

  company                  job    degree  company_n  job_n  degree_n
0  google      sales executive  bachelor          2      2         0
1  google      sales executive   masters          2      2         1
2  google      sales executive  bachelor          2      2         0
3  google      sales executive   masters          2      2         1
4  google  computer programmer  bachelor          2      1         0

In [8]:
inputs_n = inputs.drop(['company','job','degree'], axis='columns')
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      2         0
3           2      2         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [9]:
from sklearn import tree

In [10]:
model = tree.DecisionTreeClassifier()

In [11]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [12]:
model.score(inputs_n,target)

0.875

In [13]:
#2 is encoded form of google, 2 is sales executive, 1 is master
model.predict([[2,2,1]])

array([0], dtype=int64)

In [14]:
model.predict([[2,0,1]])

array([1], dtype=int64)